БСП_ВА/src/InformationRegisters/ОчередьРасширенийДляОповещений/ОчередьРасширенийДляОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРасширенийДляОповещений</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРасширений</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторРасширения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БСП_ВА/src/Enums/СостоянияРасширений/СостоянияРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРасширений</name>
  <enumValues>
    <name>Устанавливается</name>
  </enumValues>
  <enumValues>
    <name>Установлено</name>
  </enumValues>
  <enumValues>
    <name>Удаляется</name>
  </enumValues>
  <enumValues>
    <name>Удалено</name>
  </enumValues>
</mdclass:Enum>

БСП_ВА/src/Enums/ТипыУведомленийРасширений/ТипыУведомленийРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУведомленийРасширений</name>
  <enumValues>
    <name>ИзменениеСостояния</name>
  </enumValues>
  <enumValues>
    <name>ОтключениеРасширения</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеРасширения</name>
  </enumValues>
</mdclass:Enum>

БСП_ВА/src/Catalogs/ПоставляемыеРасширения/ПоставляемыеРасширения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоставляемыеРасширения</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРасширения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтключения</name>
    <type>
      <types>EnumRef.ПричиныОтключенияРасширенийВМоделиСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяетСтруктуруДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Совместимость</name>
    <attributes>
      <name>МинимальнаяВерсия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяВерсия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>ВидРазрешения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БСП_ВА/src/CommonModules/КаталогРасширенийВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция КаталогРасширенийИспользуется() Экспорт
	        
	Возврат ПолучитьФункциональнуюОпцию("ИспользованиеКаталогаРасширенийВМоделиСервиса");
	
КонецФункции

Функция ЭтоРазделенныйСеанс() Экспорт 
	
	Возврат РаботаВМоделиСервиса.ИспользованиеРазделителяСеанса();
	
КонецФункции

Процедура ЗапуститьПолучениеПраваАдминистрирования(Знач АдресОбменаДанными) Экспорт
	
	ИмяМетода = "ПрограммныйИнтерфейсСервиса.ЕстьПравоАдминистрированияПриложения";
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	МассивПараметров.Добавить(АдресОбменаДанными);
	
	ФоновыеЗадания.Выполнить(ИмяМетода, МассивПараметров, Новый УникальныйИдентификатор, НСтр("ru = 'Получение права администрирования приложения'"));
	
КонецПроцедуры

Функция ПолучитьНовыеУведомления(Знач ЕстьПравоАдминистрирования) Экспорт 
	
	МассивДанных = Новый Массив;
	
	Если ЕстьПравоАдминистрирования Тогда
		ПроверитьНаличиеОтключенныхРасширений(МассивДанных);
		ПроверитьНаличиеОбновляемыхРасширений(МассивДанных);
	КонецЕсли;
		
	ПроверитьНаличиеИзмененийСостоянийРасширений(МассивДанных);
	
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеИзмененийСостоянийРасширений(МассивДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьРасширенийДляОповещений.ИдентификаторРасширения КАК ИдентификаторРасширения,
	               |	ОчередьРасширенийДляОповещений.Пользователь КАК Пользователь,
	               |	ОчередьРасширенийДляОповещений.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.ОчередьРасширенийДляОповещений КАК ОчередьРасширенийДляОповещений
	               |ГДЕ
	               |	ОчередьРасширенийДляОповещений.Пользователь = &Пользователь
	               |	И ОчередьРасширенийДляОповещений.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияРасширений.Установлено), ЗНАЧЕНИЕ(Перечисление.СостоянияРасширений.Удалено))";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
		
	Пока Выборка.Следующий() Цикл
		
		Расширение = Справочники.ПоставляемыеРасширения.ПолучитьСсылку(Выборка.ИдентификаторРасширения);
		
		ДанныеОповещения = Новый Структура;
		ДанныеОповещения.Вставить("ТипУведомления", Перечисления.ТипыУведомленийРасширений.ИзменениеСостояния);
		ДанныеОповещения.Вставить("ИдентификаторРасширения", Выборка.ИдентификаторРасширения);
		ДанныеОповещения.Вставить("Расширение", Расширение);
		ДанныеОповещения.Вставить("Состояние", Выборка.Состояние);
		
		МассивДанных.Добавить(ДанныеОповещения);

	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеОтключенныхРасширений(МассивДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Расширения = РасширенияВМоделиСервиса.РасширенияТекущийОбластиДанных();
	
	Если ТипЗнч(Расширения) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ОтключенныеРасширения = Расширения.НайтиСтроки(Новый Структура("Отключено", Истина));
	
	Для Каждого Расширение Из ОтключенныеРасширения Цикл
		
		ДанныеОповещения = Новый Структура;
		ДанныеОповещения.Вставить("ТипУведомления", Перечисления.ТипыУведомленийРасширений.ОтключениеРасширения);
		ДанныеОповещения.Вставить("ИдентификаторРасширения", Расширение.ИспользуемоеРасширение);
		ДанныеОповещения.Вставить("Расширение", Расширение.ПоставляемоеРасширение);
		ДанныеОповещения.Вставить("Наименование", Расширение.Наименование);
		ДанныеОповещения.Вставить("Причина", Расширение.ПричинаОтключения);
		ДанныеОповещения.Вставить("ИдентификаторВерсии", Расширение.ИдентификаторВерсии);
		
		МассивДанных.Добавить(ДанныеОповещения);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеОбновляемыхРасширений(МассивДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = КаталогРасширений.ТекстЗапросаОбновляемыхРасширений();
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеОповещения = Новый Структура;
		ДанныеОповещения.Вставить("ТипУведомления", Перечисления.ТипыУведомленийРасширений.ОбновлениеРасширения);
		ДанныеОповещения.Вставить("ИдентификаторРасширения", Выборка.ПоставляемоеРасширение.УникальныйИдентификатор());
		ДанныеОповещения.Вставить("Расширение", Выборка.ПоставляемоеРасширение);
		ДанныеОповещения.Вставить("Наименование", Выборка.Наименование);
		ДанныеОповещения.Вставить("ИдентификаторВерсии", Выборка.ИдентификаторВерсии);
		
		МассивДанных.Добавить(ДанныеОповещения);	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
